RedditClone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id

        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hello!"], ["url", "google.com"], ["content", "this belongs to sub1"], ["author_id", 2], ["created_at", "2021-04-12 19:00:38.959950"], ["updated_at", "2021-04-12 19:00:38.959950"]]